Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D26.svd
            <register>
               <name>LPDDR2_LPDDR3_DDR3_CAL_MR4</name>
               <description>Low-power DDR2 Low-power DDR3 and DDR3 Calibration and MR4 Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>COUNT_CAL</name>
                     <description>LPDDR2 LPDDR3 and DDR3 Calibration Timer Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MR4_READ</name>
                     <description>Mode Register 4 Read Interval</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDDR2_LPDDR3_DDR3_TIM_CAL</name>
               <description>Low-power DDR2 Low-power DDR3 and DDR3 Timing Calibration Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ZQCS</name>
                     <description>ZQ Calibration Short</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RZQI</name>
                     <description>Built-in Self-Test for RZQ Information (read-only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RZQISelect</name>
                        <enumeratedValue>
                           <name>RZQ_NOT_SUPPORTED</name>
                           <description>RZQ self test not supported</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ZQ_VDDCA_FLOAT</name>
                           <description>The ZQ pin can be connected to VDDCA or left floating.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ZQ_SHORTED_GROUND</name>
                           <description>The ZQ pin can be shorted to ground.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ZQ_SELF_TEST_OK</name>
                           <description>ZQ pin self test complete; no error condition detected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IO_CALIBR</name>
               <description>I/O Calibration Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RDIV</name>
                     <description>Resistor Divider, Output Driver Impedance</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RDIVSelect</name>
                        <enumeratedValue>
                           <name>RZQ_34</name>
                           <description>LPDDR2 serial impedance line = 34.3 ohms,DDR2/LPDDR1 serial impedance line: Not applicable</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_40_RZQ_38_RZQ_37_RZQ_35</name>
                           <description>LPDDR2 serial impedance line = 40 ohms,LPDDR3 serial impedance line = 38 ohms,DDR3 serial impedance line = 37 ohms,DDR2/LPDDR1 serial impedance line = 35 ohms</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_48_RZQ_46_RZQ_44_RZQ_43</name>
                           <description>LPDDR2 serial impedance line = 48 ohms,LPDDR3 serial impedance line = 46 ohms,DDR3 serial impedance line = 44 ohms,DDR2/LPDDR1 serial impedance line = 43 ohms</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_60_RZQ_57_RZQ_55_RZQ_52</name>
                           <description>LPDDR2 serial impedance line = 60 ohms,LPDDR3 serial impedance line = 57 ohms,DDR3 serial impedance line = 55 ohms,DDR2/LPDDR1 serial impedance line = 52 ohms</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_80_RZQ_77_RZQ_73_RZQ_70</name>
                           <description>LPDDR2 serial impedance line = 80 ohms,LPDDR3 serial impedance line = 77 ohms,DDR3 serial impedance line = 73 ohms,DDR2/LPDDR1 serial impedance line = 70 ohms</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RZQ_120_RZQ_115_RZQ_110_RZQ_105</name>
                           <description>LPDDR2 serial impedance line = 120 ohms,LPDDR3 serial impedance line = 115 ohms,DDR3 serial impedance line = 110 ohms,DDR2/LPDDR1 serial impedance line = 105 ohms</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_CALIB</name>
                     <description>Enable Calibration</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EN_CALIBSelect</name>
                        <enumeratedValue>
                           <name>DISABLE_CALIBRATION</name>
                           <description>Calibration is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_CALIBRATION</name>
                           <description>Calibration is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TZQIO</name>
                     <description>IO Calibration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>CALCODEP</name>
                     <description>Number of Transistor P (read-only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CALCODEN</name>
                     <description>Number of Transistor N (read-only)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS</name>
               <description>OCMS Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SCR_EN</name>
                     <description>Scrambling Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS_KEY1</name>
               <description>OCMS KEY1 Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY1</name>
                     <description>Off-chip Memory Scrambling (OCMS) Key Part 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS_KEY2</name>
               <description>OCMS KEY2 Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>Off-chip Memory Scrambling (OCMS) Key Part 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONF_ARBITER</name>
               <description>Configuration Arbiter Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ARB</name>
                     <description>Type of Arbitration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ARBSelect</name>
                        <enumeratedValue>
                           <name>ROUND</name>
                           <description>Round Robin</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NB_REQUEST</name>
                           <description>Request Policy</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANDWIDTH</name>
                           <description>Bandwidth Policy</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BDW_MAX_CUR</name>
                     <description>Bandwidth Max or Current</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P0</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P1</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P2</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P3</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P4</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P5</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P6</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RQ_WD_P7</name>
                     <description>Request or Word from Port X</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P0</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P1</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P2</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P3</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P4</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P5</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P6</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MA_PR_P7</name>
                     <description>Master or Software Provide Information</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P0</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P1</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P2</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P3</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P4</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P5</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P6</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BDW_BURST_P7</name>
                     <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMEOUT</name>
               <description>Timeout Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TIMEOUT_P0</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P1</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P2</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P3</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P4</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P5</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P6</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT_P7</name>
                     <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REQ_PORT_0123</name>
               <description>Request Port 0-1-2-3 Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NRQ_NWD_BDW_P0</name>
                     <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P1</name>
                     <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P2</name>
                     <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P3</name>
                     <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>REQ_PORT_4567</name>
               <description>Request Port 4-5-6-7 Register</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NRQ_NWD_BDW_P4</name>
                     <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P5</name>
                     <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P6</name>
                     <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NRQ_NWD_BDW_P7</name>
                     <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
