Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D26.svd
               <register>
                  <name>HSMC_REM11_</name>
                  <description>PMECC Remainder 11 Register (sec_num = 0)</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM12_</name>
                  <description>PMECC Remainder 12 Register (sec_num = 0)</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM13_</name>
                  <description>PMECC Remainder 13 Register (sec_num = 0)</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM14_</name>
                  <description>PMECC Remainder 14 Register (sec_num = 0)</description>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSMC_REM15_</name>
                  <description>PMECC Remainder 15 Register (sec_num = 0)</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>REM2NP1</name>
                        <description>BCH Remainder 2 * N + 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                     <field>
                        <name>REM2NP3</name>
                        <description>BCH Remainder 2 * N + 3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>14</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>HSMC_ELCFG</name>
               <description>PMECC Error Location Configuration Register</description>
               <addressOffset>0x500</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SECTORSZ</name>
                     <description>Sector Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SECTORSZSelect</name>
                        <enumeratedValue>
                           <name>SECTORSZ0</name>
                           <description>Use  512 Byte Sector in Location Computation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SECTORSZ1</name>
                           <description>Use 1024 Byte Sector in Location Computation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERRNUM</name>
                     <description>Number of Errors</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELPRIM</name>
               <description>PMECC Error Location Primitive Register</description>
               <addressOffset>0x504</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PRIMITIV</name>
                     <description>Primitive Polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELEN</name>
               <description>PMECC Error Location Enable Register</description>
               <addressOffset>0x508</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ENINIT</name>
                     <description>Error Location Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELDIS</name>
               <description>PMECC Error Location Disable Register</description>
               <addressOffset>0x50C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DIS</name>
                     <description>Disable Error Location Engine</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELSR</name>
               <description>PMECC Error Location Status Register</description>
               <addressOffset>0x510</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>Error Location Engine Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELIER</name>
               <description>PMECC Error Location Interrupt Enable register</description>
               <addressOffset>0x514</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Computation Terminated Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELIDR</name>
               <description>PMECC Error Location Interrupt Disable Register</description>
               <addressOffset>0x518</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Computation Terminated Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELIMR</name>
               <description>PMECC Error Location Interrupt Mask Register</description>
               <addressOffset>0x51C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Computation Terminated Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_ELISR</name>
               <description>PMECC Error Location Interrupt Status Register</description>
               <addressOffset>0x520</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Computation Terminated Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERR_CNT</name>
                     <description>Error Counter value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA0</name>
               <description>PMECC Error Location SIGMA 0 Register</description>
               <addressOffset>0x528</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SIGMA0</name>
                     <description>Coefficient of degree 0 in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA1</name>
               <description>PMECC Error Location SIGMA 1 Register</description>
               <addressOffset>0x52C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA1</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA2</name>
               <description>PMECC Error Location SIGMA 2 Register</description>
               <addressOffset>0x530</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA2</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA3</name>
               <description>PMECC Error Location SIGMA 3 Register</description>
               <addressOffset>0x534</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA3</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA4</name>
               <description>PMECC Error Location SIGMA 4 Register</description>
               <addressOffset>0x538</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA4</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA5</name>
               <description>PMECC Error Location SIGMA 5 Register</description>
               <addressOffset>0x53C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA5</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA6</name>
               <description>PMECC Error Location SIGMA 6 Register</description>
               <addressOffset>0x540</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA6</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA7</name>
               <description>PMECC Error Location SIGMA 7 Register</description>
               <addressOffset>0x544</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA7</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA8</name>
               <description>PMECC Error Location SIGMA 8 Register</description>
               <addressOffset>0x548</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA8</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA9</name>
               <description>PMECC Error Location SIGMA 9 Register</description>
               <addressOffset>0x54C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA9</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA10</name>
               <description>PMECC Error Location SIGMA 10 Register</description>
               <addressOffset>0x550</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA10</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA11</name>
               <description>PMECC Error Location SIGMA 11 Register</description>
               <addressOffset>0x554</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA11</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA12</name>
               <description>PMECC Error Location SIGMA 12 Register</description>
               <addressOffset>0x558</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA12</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA13</name>
               <description>PMECC Error Location SIGMA 13 Register</description>
               <addressOffset>0x55C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA13</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA14</name>
               <description>PMECC Error Location SIGMA 14 Register</description>
               <addressOffset>0x560</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA14</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA15</name>
               <description>PMECC Error Location SIGMA 15 Register</description>
               <addressOffset>0x564</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA15</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA16</name>
               <description>PMECC Error Location SIGMA 16 Register</description>
               <addressOffset>0x568</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA16</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA17</name>
               <description>PMECC Error Location SIGMA 17 Register</description>
               <addressOffset>0x56C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA17</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA18</name>
               <description>PMECC Error Location SIGMA 18 Register</description>
               <addressOffset>0x570</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA18</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA19</name>
               <description>PMECC Error Location SIGMA 19 Register</description>
               <addressOffset>0x574</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA19</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SIGMA20</name>
               <description>PMECC Error Location SIGMA 20 Register</description>
               <addressOffset>0x578</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SIGMA20</name>
                     <description>Coefficient of degree x in the SIGMA polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
