Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D26.svd
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmit Ready Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmit Empty Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRDY</name>
                     <description>Receive Ready Interrupt Mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRUN</name>
                     <description>Receive Overrun Interrupt Mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP0</name>
                     <description>Compare 0 Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP1</name>
                     <description>Compare 1 Interrupt Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSYN</name>
                     <description>Tx Sync Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSYN</name>
                     <description>Rx Sync Interrupt Mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x535343</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protect Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="SSC0">
         <name>SSC1</name>
         <baseAddress>0xFC004000</baseAddress>
         <interrupt>
            <name>SSC1</name>
            <value>44</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TC0</name>
         <version>6082ZO</version>
         <description>Timer Counter</description>
         <groupName>TC</groupName>
         <prependToName>TC_</prependToName>
         <baseAddress>0xF800C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xE8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TC0</name>
            <value>35</value>
         </interrupt>
         <registers>
            <cluster>
               <dim>3</dim>
               <dimIncrement>64</dimIncrement>
               <name>TC_CHANNEL[%s]</name>
               <description/>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CCR</name>
                  <description>Channel Control Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CLKEN</name>
                        <description>Counter Clock Enable Command</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKDIS</name>
                        <description>Counter Clock Disable Command</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SWTRG</name>
                        <description>Software Trigger Command</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CMR_CAPTURE_MODE</name>
                  <description>Channel Mode Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>TCCLKS</name>
                        <description>Clock Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>TCCLKSSelect</name>
                           <enumeratedValue>
                              <name>TIMER_CLOCK1</name>
                              <description>Clock selected: internal GCLK [35], GCLK [36] clock signal (from PMC)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK2</name>
                              <description>Clock selected: internal System bus clock divided by 8 clock signal (from PMC)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK3</name>
                              <description>Clock selected: internal System bus clock divided by 32 clock signal (from PMC)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK4</name>
                              <description>Clock selected: internal System bus clock divided by 128 clock signal (from PMC)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK5</name>
                              <description>Clock selected: internal slow_clock clock signal (from PMC)</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC0</name>
                              <description>Clock selected: XC0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC1</name>
                              <description>Clock selected: XC1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC2</name>
                              <description>Clock selected: XC2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CLKI</name>
                        <description>Clock Invert</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BURST</name>
                        <description>Burst Signal Selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BURSTSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>The clock is not gated by an external signal.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC0</name>
                              <description>XC0 is ANDed with the selected clock.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC1</name>
                              <description>XC1 is ANDed with the selected clock.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC2</name>
                              <description>XC2 is ANDed with the selected clock.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LDBSTOP</name>
                        <description>Counter Clock Stopped with RB Loading</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDBDIS</name>
                        <description>Counter Clock Disable with RB Loading</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGEDG</name>
                        <description>External Trigger Edge Selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>ETRGEDGSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>The clock is not gated by an external signal.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Rising edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Falling edge</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EDGE</name>
                              <description>Each edge</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ABETRG</name>
                        <description>TIOAx or TIOBx External Trigger Selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCTRG</name>
                        <description>RC Compare Trigger Enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAVE</name>
                        <description>Waveform Mode</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRA</name>
                        <description>RA Loading Edge Selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LDRASelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>None</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Rising edge of TIOAx</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Falling edge of TIOAx</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EDGE</name>
                              <description>Each edge of TIOAx</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LDRB</name>
                        <description>RB Loading Edge Selection</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LDRBSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>None</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Rising edge of TIOAx</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Falling edge of TIOAx</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EDGE</name>
                              <description>Each edge of TIOAx</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SBSMPLR</name>
                        <description>Loading Edge Subsampling Ratio</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>SBSMPLRSelect</name>
                           <enumeratedValue>
                              <name>ONE</name>
                              <description>Load a Capture register each selected edge</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF</name>
                              <description>Load a Capture register every 2 selected edges</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FOURTH</name>
                              <description>Load a Capture register every 4 selected edges</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EIGHTH</name>
                              <description>Load a Capture register every 8 selected edges</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SIXTEENTH</name>
                              <description>Load a Capture register every 16 selected edges</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
